
fs=1024; %抽样频率，记得要高于信号中最高频率的2倍
N=1024; %采样点数
t=(0:N-1)/fs; %采样时间序列s，时域横轴
f=20; %设置信号频率Hz
%x=sin(2*pi*f*t); %生成信号
FWHM=50e-12;            %高斯信号FWHM宽度，为50ps
x=exp(-0.5*(2*sqrt(2*log(2))*(t-2.5e-9)/FWHM).^2); %高斯脉冲，中心位于2.5ns处。
subplot(121);
plot(t*1e9,x);
xlabel('t/s');
xf=fft(x,N)/N; 
xf=fftshift(xf); %双边复数谱
df=fs/N; %频率分辨率Hz
%绘制双边幅值谱
f=(-N/2:N/2-1)*df; %频域序列,频域横轴
subplot(122);
plot(f,abs(xf));
xlabel('f/Hz');
% 
% figure;
% 
% 
% 
% 
% clear all;   %这个其实可以没有，只不过以前出过问题，现在就加上！
% N=50;      %这个是你举得信号的点数，随便你了
% fs=1024;       %这个是抽样频率，记得要高于信号中最高频率的2倍
% t=(0:N-1)/fs;     %没啥好说的，信号时域横轴向量
% f=(-N/2:N/2-1)*fs/N;    %没啥好说的，信号频域横轴向量，不过待会要减半处理一下
% ff=20;
% x=sin(2*pi*ff.*t);   %这个更没啥好说的，想分析什么函数，你自己打吧
% y=abs(fftshift(fft(x)));     %依旧没有什么好说的，频域分析吗。不过记得要求模
% % f=f(1,N/2);      %正事：减半了
% % y=y(1,N/2);      %正事：减半了
% subplot(1,2,1)   %画图
% plot(t,x);
% subplot(1,2,2)   %画图
% plot(f,y);